sulaolab/nora-hal-dspic33ak-spi-i2s-tdm/src/dspic33ak_spi_i2s_tdm.c

//===========================================================
// INCLUDES
//===========================================================
#include "dspic33ak_spi_i2s_tdm_conf.h"

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
// The silicon layer (SPIxCON1/BRG register writer, the s_spi_dev[] device-facts table,
// per-SPI DMA-channel config) lives in dspic33ak_spi_i2s_tdm_hw.*, and the block
// counters + ISR load/time monitor in dspic33ak_spi_i2s_tdm_diag.*. So the transport
// core no longer pulls the SPI register masks (reg.h), high-res timer, debug GPIO, or
// <stdio.h> -- it orchestrates instances and runs the block ISR, delegating register
// pokes to hw.* and diagnostics to diag.*.
#include "dspic33ak_dma.h"
#include "dspic33ak_spi_i2s_tdm.h"
#include "dspic33ak_spi_i2s_tdm_hw.h"      // silicon layer: tdm_spi_inst_t + register/DMA ops
#include "dspic33ak_spi_i2s_tdm_fs_clc.h"  // CLC10 50%-FS generator (TDM master + FS_50PCT)
#include "dspic33ak_spi_i2s_tdm_diag.h"    // block counters + ISR load/time monitor (separated)




//===========================================================
// Definition
//===========================================================
// Unknown-device guard is centralized in dspic33ak_spi_i2s_tdm.h: the
// DSPIC33AK_SPI_I2S_TDM_DEVICE derivation #error's on any unsupported device.


// DMA global address-window values are owned by the DMA HAL
// (DSPIC33AK_DMA_ADDR_WINDOW_LOW / _HIGH in dspic33ak_dma.h), set by
// dspic33ak_dma_global_init(). SPI-TDM keeps only per-channel cfg values.




// Debug switches live with their code now: the DMA-config-error printf in the silicon
// layer (dspic33ak_spi_i2s_tdm_hw.c) and the scope-GPIO/load monitor in the diagnostics
// module (dspic33ak_spi_i2s_tdm_diag.c) each carry their own ENA_TDM_DBG. The transport
// core compiles with no printf/GPIO dependency.

// Per-instance DMA channel assignment comes from conf.h (DSPIC33AK_TDM_SPIn_*_DMA);
// the core no longer hardcodes DMA channel index constants.

#define TDM_ARRAY_SIZE(a) (sizeof(a) / sizeof((a)[0]))
#define TDM_COMPILEASSERT(exp) extern int tdm_compile_assert[(exp) ? 1 : -1] __attribute__((unused))




//--------------------------------------------







//===========================================================
// Enum & Struct typedef
//===========================================================

// tdm_spi_inst_t (physical SPI instances) + the silicon device-facts table live in the
// silicon layer (dspic33ak_spi_i2s_tdm_hw.*). The transport core indexes its own leg
// table with the leg-index enum below and stores the physical SPI in each leg's spi_inst.
//
// Explicit dense leg-index enum: one TDM_SPI_LEG_<name> per descriptor row, in table order,
// terminated by TDM_SPI_LEG_COUNT (= the built-in leg count). Used only inside the core
// (leg table / inst()), so it lives here rather than in a shared header. The SPI1/SPI2 row
// names are legacy logical labels; DSPIC33AK_TDM_BASE_ON_SPI34 maps those same rows to
// physical SPI3/SPI4. Public spiN() accessors search the stored physical spi_inst instead.
// Adding a leg = add an enumerator here + its buffers, s_spi_legs[] row, and RX vector below.
typedef enum {
    TDM_SPI_LEG_SPI1 = 0,
#if DSPIC33AK_TDM_USE_SPI2
    TDM_SPI_LEG_SPI2,
#endif
#if DSPIC33AK_TDM_USE_SPI3
    TDM_SPI_LEG_SPI3,
#endif
#if DSPIC33AK_TDM_USE_SPI4
    TDM_SPI_LEG_SPI4,
#endif
    TDM_SPI_LEG_COUNT
} tdm_spi_leg_index_t;

// Which leg the arg-less singleton status API reports is the stream's primary_leg_index
// (tdm_stream_t), defaulting to logical leg 0. It is NOT a clock master and NOT a hard
// timing coupling -- every leg times itself via its own RX-block ISR; the clock role
// (master/slave) is a separate per-leg concern in config.clock_role.

// Private SPI leg descriptor == the public opaque instance handle
// (dspic33ak_spi_i2s_tdm_inst_t). One physical SPI leg per row owns the SPI
// peripheral, RX/TX DMA channels, ping-pong buffers, its own block callback, and
// its own diagnostics. Each instance's RX-block ISR delivers ONLY this instance's
// RX/TX block to this instance's callback.
struct dspic33ak_spi_i2s_tdm_inst_s {
    tdm_spi_inst_t spi_inst;
    uint8_t        rx_dma_ch;
    uint8_t        tx_dma_ch;
    int32_t       *rx_buffer;
    int32_t       *tx_buffer;
    uint32_t       buffer_word_count;   // total words (2 * slots * blk) -- both ping+pong
    uint8_t        geom_slots_per_fs;   // THIS leg's compile-time slots/FS (buffer geometry)
    uint16_t       geom_block_frames;   // THIS leg's compile-time frames per ping/pong half
    // Sync domain id: legs sharing a domain are co-clocked and started phase-locked as a group
    // (start_domain arms all members, then releases SPIEN back-to-back so their ping-pong DMAs
    // latch one FS edge). Legs in DIFFERENT domains are independent/async (e.g. ASRC A vs B).
    // Orthogonal to config.clock_role (the clock driver). Which leg the arg-less singleton
    // status API reports is the stream's primary_leg_index (tdm_stream_t), not a per-leg flag.
    uint8_t        sync_domain;
    dspic33ak_spi_i2s_tdm_config_t config;         // includes this leg's OWN clock role
    bool           config_valid;
    dspic33ak_spi_i2s_tdm_block_cb_t block_cb;     // this instance's block callback
    void                            *block_user;   // opaque user pointer for block_cb
    dspic33ak_spi_i2s_tdm_diag_t     diag;         // this instance's counters + ISR load monitor
    volatile bool                    running;      // this instance started (inst_start..inst_stop)
};
typedef struct dspic33ak_spi_i2s_tdm_inst_s tdm_spi_leg_t;

typedef struct
{
    tdm_spi_leg_t                      *legs;
    uint8_t                             leg_count;
    // Index (< leg_count) of the PRIMARY leg: the one the arg-less singleton status API
    // (is_running/is_active/get_status/get_load) reports. Every leg times itself via its
    // own RX-block ISR, so this is only a reporting default, NOT a clock-role or timing
    // coupling. Replaces the former per-leg is_block_timing_master "exactly one, leg 0" flag.
    uint8_t                             primary_leg_index;
    // open() succeeded (external clock up + pins/CLC routed via the port). start/arm are
    // gated on this so a caller cannot enter SPIEN with the port unrouted / readiness
    // unchecked (a silent dead stream). Set by open(), cleared by close().
    bool                                opened;
    const dspic33ak_spi_i2s_tdm_port_t *port;

    // Block callback, diagnostics, and the running flag are now owned PER INSTANCE
    // (in tdm_spi_leg_t), not by the stream, so SPI1 and SPI2 each deliver their own
    // block, measure their own ISR load, and start/stop independently.
} tdm_stream_t;


//===========================================================
// Function Prototype
//===========================================================

// pin routing + CLC pass-through live on the board adapter and are reached
// through the registered port callbacks, NOT called by name -- the core no
// longer includes audio_app_board.h.

