sulaolab/nora-hal-dspic33ak-spi-i2s-tdm/src/dspic33ak_spi_i2s_tdm.c
/*
 * Close the shared port after all instances are stopped.
 *
 * Deliberately a near-no-op: like stop(), the HAL does NOT tear down PPS/CLC routing
 * or the external clock -- other peripherals (or the next open()/start()) may depend
 * on them, and the port has no deinit hook. Provided for lifecycle symmetry and as
 * the place a future clock-deinit hook would run.
 *
 * Rejected (false, stays open) while any leg is still running: closing under a live stream
 * would make the lifecycle state (closed) disagree with the hardware (SPI/DMA still on).
 * Stop every leg first (inst_stop / stop_all_domains). Does NOT change the config mode --
 * mode is a property of the committed configuration, not of open/close, so a closed stream
 * keeps its SINGLE/SYSTEM shape for the next open()->start.
 */
bool dspic33ak_spi_i2s_tdm_close( void )
{
    if( tdm_any_leg_running() )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }
    s_stream.opened = false;   // a fresh open() is required before the next start/arm
    // No hardware teardown by design (see above). Config mode is intentionally preserved.
    tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NONE );
    return true;
}


// The board-specific config lives in the integrator's board/platform layer (a board TDM-config
// table). The core no longer fabricates a config from build macros; callers supply it explicitly
// via inst_configure() / configure_system().


/*
 * Store a validated configuration for ONE instance (declaration only; no HW write).
 *
 * This is the SINGLE-mode, PRIMARY-only per-leg entry. Rejected (false) if: the port is
 * already open()'d (ERR_ALREADY_OPEN -- configure before open); the stream was committed via
 * configure_system() (mode==SYSTEM -> ERR_CONFIG_MODE; a system caller stays transactional);
 * inst is not the primary leg (ERR_CONFIG_MODE -- a non-primary leg is only reachable through
 * configure_system()); the instance is running or invalid; or cfg is outside the supported
 * wire-format envelope (NULL-safe). On success the config is stored and the mode becomes
 * SINGLE. Each leg carries its OWN clock role (the transport is rate-agnostic; a slave leg is
 * SLAVE because it was configured SLAVE). start() applies the stored config to the hardware.
 */
bool dspic33ak_spi_i2s_tdm_inst_configure( dspic33ak_spi_i2s_tdm_inst_t* inst,
                                           const dspic33ak_spi_i2s_tdm_config_t* cfg )
{
    // Reconfiguring a live instance would glitch (or tear) the framing mid-block; the
    // contract is stop -> configure -> start, so reject configure while running.
    if( inst == NULL )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    // Configure happens BEFORE open(): open() consumes this config to derive the clock role
    // and route pins/CLC, so configuring under an open port would desync HW from the config.
    if( s_stream.opened )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_OPEN );
        return false;
    }
    // Mode ownership: a SYSTEM-committed stream must be reconfigured only transactionally
    // (configure_system); and the per-leg API only ever addresses the PRIMARY leg. A
    // non-primary leg is configured exclusively through configure_system().
    if( s_config_mode == TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( !tdm_inst_is_primary( inst ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( inst->running )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }
    if( !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( cfg == NULL )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_ARGUMENT );
        return false;
    }
    if( !tdm_config_is_supported( inst, cfg ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG );
        return false;
    }
    // The leg's sync_domain (from the conf.h seed here; configure_system overwrites it) must fit
    // the 0..31 range start_all_domains()'s dedup/rollback mask can track -- guard the per-leg
    // path too (configure_system already checks it). See also the conf.h SYNC_DOMAIN #error.
    if( inst->sync_domain >= 32u )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY );
        return false;
    }

    inst->config       = *cfg;
    inst->config_valid = true;
    s_config_mode      = TDM_CONFIG_MODE_SINGLE;   // per-leg primary API now owns the config
    tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Read one leg's COMMITTED setup (stored config + sync domain) into *setup.
 *
 * PURE query: returns false -- and touches neither *setup nor the last-error -- if inst is
 * NULL, setup is NULL, or the leg is not configured. Leaving last-error alone matters so a
 * board hook calling this during open() cannot clobber the real bring-up failure code.
 * Returning false for an unconfigured leg lets the caller distinguish it from a valid SLAVE
 * (role value 0) and SKIP an optional leg not part of this run (e.g. CMSIS single-instance).
 */
bool dspic33ak_spi_i2s_tdm_inst_get_setup( const dspic33ak_spi_i2s_tdm_inst_t* inst,
                                           dspic33ak_spi_i2s_tdm_leg_setup_t* setup )
{
    if( ( inst == NULL ) || ( setup == NULL ) || !inst->config_valid )
    {
        return false;
    }
    setup->stream      = inst->config;
    setup->sync_domain = inst->sync_domain;
    return true;
}


/*
 * Do two legs sharing a sync domain agree on the BCLK/FS frame interpretation?
 *
 * Co-clocked legs (same sync_domain) ride ONE shared bit/frame clock, so the fields that
 * define HOW that shared clock is read must be identical on every member -- otherwise the
 * legs would sample the same wires with different framing. Compared: format, word_bits,
 * slots_per_fs, block_frames, fs_coincides_first_bclk (SPIFE), bclk_idle_high (CKP),
 * bclk_change_on_active_to_idle (CKE), AND fs_shape. fs_shape is compared because for I2S it
 * maps to FRMSYPW regardless of clock role (hw: FS_50PCT+I2S -> FRMSYPW=1, FS_PULSE -> 0), so
 * two co-clocked I2S legs with different fs_shape would read the SAME FS with different pulse
 * widths. Deliberately NOT compared (may legitimately differ per leg): clock_role (exactly one
 * master drives the shared clock, the rest are slaves), brg (a slave ignores it), and
 * mclk_enable. IGNROV/IGNTUR are HAL-fixed policies, not per-leg config fields.
 */
static bool tdm_domain_framing_matches( const dspic33ak_spi_i2s_tdm_config_t* a,
                                        const dspic33ak_spi_i2s_tdm_config_t* b )
{
    return ( a->format                        == b->format ) &&
           ( a->word_bits                     == b->word_bits ) &&
           ( a->slots_per_fs                  == b->slots_per_fs ) &&
           ( a->block_frames                  == b->block_frames ) &&
           ( a->fs_coincides_first_bclk       == b->fs_coincides_first_bclk ) &&
           ( a->bclk_idle_high                == b->bclk_idle_high ) &&
           ( a->bclk_change_on_active_to_idle == b->bclk_change_on_active_to_idle ) &&
           ( a->fs_shape                      == b->fs_shape );
}


