sulaolab/nora-hal-dspic33ak-spi-i2s-tdm/src/dspic33ak_spi_i2s_tdm.c
/*
 * Transactional whole-system configure. setups[i] targets leg index i; setup_count must
 * equal the built leg count (TDM_SPI_LEG_COUNT). See the header for the contract.
 *
 * Two passes, all-or-nothing:
 *   1. PREFLIGHT (zero side effects) -- every leg must be a valid descriptor, STOPPED, and
 *      its stream must pass tdm_config_is_supported; each sync domain may hold at most one
 *      clock MASTER; and legs sharing a sync domain must agree on the frame interpretation
 *      (tdm_domain_framing_matches). Any failure rejects the whole set before a leg is touched.
 *   2. COMMIT -- only after a clean preflight, store each leg's config + sync_domain +
 *      config_valid together. Because preflight already validated everything, commit cannot
 *      fail, so there is never a partially-configured mix (SPI1-new + SPI2-old).
 *
 * The caller owns stop->configure->start: this does NOT stop a running transport (it
 * rejects one via the STOPPED preflight), keeping the call side-effect-free on rejection.
 */
bool dspic33ak_spi_i2s_tdm_configure_system( const dspic33ak_spi_i2s_tdm_leg_setup_t* setups,
                                             uint8_t setup_count )
{
    if( ( setups == NULL ) || ( setup_count != (uint8_t)TDM_SPI_LEG_COUNT ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_ARGUMENT );
        return false;
    }
    // Configure happens BEFORE open() (open() consumes the committed config). A full recommit
    // is allowed from ANY mode (NONE/SINGLE/SYSTEM) as long as the port is closed and every
    // leg is stopped (the STOPPED preflight below enforces the latter).
    if( s_stream.opened )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_OPEN );
        return false;
    }

    // 1a. PREFLIGHT: each leg valid, stopped, and its stream supported. Zero side effects.
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        dspic33ak_spi_i2s_tdm_inst_t* leg = dspic33ak_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || !tdm_spi_leg_is_valid( leg ) )
        {
            tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
            return false;
        }
        if( leg->running )
        {
            tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
            return false;
        }
        if( !tdm_config_is_supported( leg, &setups[i].stream ) )
        {
            tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG );
            return false;
        }
        // sync_domain must fit the 0..31 range that start_all_domains()'s 32-bit dedup/rollback
        // mask can track. A domain id >= 32 would be silently dropped from the started-mask, so
        // its legs could be started twice or skipped on rollback. Reject at configure (fail
        // closed) rather than misbehave at start. (Upstream uses 0/1; this guards public reuse.)
        if( setups[i].sync_domain >= 32u )
        {
            tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY );
            return false;
        }
    }

    // 1b. PREFLIGHT: at most one clock MASTER per sync domain (a domain has exactly one
    // clock source; two masters would fight for BCLK/FS).
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        if( setups[i].stream.clock_role != DSPIC33AK_SPI_I2S_TDM_CLOCK_MASTER )
        {
            continue;
        }
        for( uint8_t j = i + 1u; j < setup_count; j++ )
        {
            if( ( setups[j].sync_domain == setups[i].sync_domain ) &&
                ( setups[j].stream.clock_role == DSPIC33AK_SPI_I2S_TDM_CLOCK_MASTER ) )
            {
                tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY );
                return false;
            }
        }
    }

    // 1c. PREFLIGHT: legs sharing a sync domain are co-clocked on ONE BCLK/FS, so their frame
    // interpretation must be identical (a mismatch would read the shared clock differently on
    // each leg). See tdm_domain_framing_matches for the fields compared vs allowed to differ.
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        for( uint8_t j = (uint8_t)(i + 1u); j < setup_count; j++ )
        {
            if( ( setups[j].sync_domain == setups[i].sync_domain ) &&
                !tdm_domain_framing_matches( &setups[i].stream, &setups[j].stream ) )
            {
                tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY );
                return false;
            }
        }
    }

    // 2. COMMIT: preflight guarantees success, so store all legs together (config,
    // sync_domain, config_valid) -- the topology table is now the single source of both
    // the stream and the sync domain.
    for( uint8_t i = 0u; i < setup_count; i++ )
    {
        dspic33ak_spi_i2s_tdm_inst_t* leg = dspic33ak_spi_i2s_tdm_inst( i );
        leg->config       = setups[i].stream;
        leg->sync_domain  = setups[i].sync_domain;
        leg->config_valid = true;
    }
    s_config_mode = TDM_CONFIG_MODE_SYSTEM;   // whole-system domain API now owns the config
    tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NONE );
    return true;
}




/*
 * Start ONE instance: arm its RX/TX DMA, then program + enable its SPI (triggers,
 * then module ON). The shared port must already be open()'d. Returns false (instance
 * left stopped, its HW rolled back) if it is not configured, already running, or DMA
 * setup fails. Does NOT touch the port or any other instance -- the caller orders
 * multi-instance starts (co-clocked slave legs before the clock-master leg so every
 * output is armed by the time the master's clock/FS cadence begins).
 */
// ARM stage: everything up to (but NOT including) the SPI module ON. After this the DMA is
// configured/armed and the SPI is fully programmed but held OFF, so the transfer stream has
// not started. Pair with inst_go() to release. Splitting start into arm+go lets a caller ARM
// several co-clocked legs and then release them back-to-back (both SPIEN within one FS frame)
// so their ping-pong DMAs latch the SAME first FS edge = phase-locked (wdiff=0). Returns false
// (rolled back) on any failure, same as inst_start().
static bool tdm_inst_arm( dspic33ak_spi_i2s_tdm_inst_t* inst )
{
    dspic33ak_spi_i2s_tdm_config_t eff_cfg;

    // Gate FIRST -- do not arm DMA/SPI unless this instance is actually going to run.
    // config_valid implies the config already passed configure()'s envelope check.
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( !inst->config_valid )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NOT_CONFIGURED );
        return false;
    }
    if( inst->running )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }
    // open() (shared clock/pins/CLC + readiness) must have run first -- arming DMA/SPI without
    // it would enter SPIEN with the port unrouted (a silent dead stream). Fail closed.
    if( !s_stream.opened )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }
    // Resolve the register-level config (a validated copy of the leg's own stored config).
    if( !tdm_spi_leg_get_effective_config( inst, &eff_cfg ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG );
        return false;
    }

    // Fresh diagnostics + a deterministic first block for this instance.
    dspic33ak_spi_i2s_tdm_diag_reset( &inst->diag );
    tdm_inst_clear_buffers( inst );

    // Arm this instance's RX/TX DMA; on failure roll back ITS DMA/SPI so a partial
    // start leaves no channel with CHEN/IE set and the SPI off.
    if( !dspic33ak_spi_i2s_tdm_hw_dma_config( inst->spi_inst,
                                              inst->rx_dma_ch, inst->tx_dma_ch,
                                              inst->rx_buffer, inst->tx_buffer,
                                              inst->buffer_word_count ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_DMA_CONFIG );
        goto fail;
    }

    // Program + enable this instance's SPI: registers, then DMA-trigger events, then
    // the module ON (ON is the last step, after the port pins/CLC are routed).
    dspic33ak_spi_i2s_tdm_hw_apply_config( inst->spi_inst, &eff_cfg );
    dspic33ak_spi_i2s_tdm_hw_dma_trigger_enable( inst->spi_inst, true );

    // FS_50PCT on a TDM master: the SPI emits a half-frame marker (set by apply_config);
    // engage CLC10 to toggle it into a 50%-duty FS on the same FS pin BEFORE the module
    // turns on, so the very first marker is captured. I2S (native 50%), FS_PULSE, and any
    // slave (FS is an input) need no CLC -- release it in case this instance held it before.
    if( ( eff_cfg.clock_role   == DSPIC33AK_SPI_I2S_TDM_CLOCK_MASTER ) &&
        ( eff_cfg.format == DSPIC33AK_SPI_I2S_TDM_FORMAT_TDM )  &&
        ( eff_cfg.fs_shape == DSPIC33AK_SPI_I2S_TDM_FS_50PCT ) )
    {
        const dspic33ak_spi_i2s_tdm_fs_clc_result_t clc =
            dspic33ak_spi_i2s_tdm_fs_clc_engage( inst->spi_inst );
        if( clc != DSPIC33AK_SPI_I2S_TDM_FS_CLC_OK )
        {
            // BUSY = CLC10 already owned by another instance/domain; NO_FS_PIN = FS not on a
            // physical pin (or no CLC10 on this part).
            tdm_set_error( ( clc == DSPIC33AK_SPI_I2S_TDM_FS_CLC_BUSY )
                               ? DSPIC33AK_SPI_I2S_TDM_ERR_CLC
                               : DSPIC33AK_SPI_I2S_TDM_ERR_PIN_CONFIG );
            goto fail;
        }
    }
    else
    {
        dspic33ak_spi_i2s_tdm_fs_clc_release( inst->spi_inst );
    }

    // ARMED: SPI module still OFF. Caller issues inst_go() to release the transfer stream.
    tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NONE );
    return true;

