sulaolab/nora-hal-dspic33ak-spi-i2s-tdm/src/dspic33ak_spi_i2s_tdm.c
fail:
    tdm_inst_soft_stop_dma( inst );
    tdm_inst_clear_dma_flags( inst );
    dspic33ak_spi_i2s_tdm_hw_soft_stop( inst->spi_inst );
    dspic33ak_spi_i2s_tdm_hw_irq_clear_flags( inst->spi_inst );
    inst->running = false;
    return false;
}


// GO stage: release an armed instance's transfer stream (SPI module ON). For a framed slave
// this starts on the next FS edge; for a master it begins generating BCLK/FS. Issue the go()
// of co-clocked legs back-to-back (slaves first, an internal FS master last) so all latch the
// same FS. No-op-safe only on an armed instance; call exactly once after inst_arm().
static void tdm_inst_go( dspic33ak_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        return;
    }
    dspic33ak_spi_i2s_tdm_hw_module_enable( inst->spi_inst, true );
    inst->running = true;
}


// Convenience: arm + go one instance (single-instance start). SINGLE-mode + PRIMARY-only:
// the per-leg start path is for the one-leg (e.g. CMSIS-SAI) driver; a co-clocked group or
// any non-primary leg must start through start_domain()/start_all_domains() so the domain
// invariants (one master, matching framing, phase-locked release) are enforced.
//
// Validation order (matches start_domain()): instance validity -> config mode -> primary ->
// opened -> clock readiness -> arm -> go. opened is checked BEFORE readiness so a start before
// open() returns ERR_NOT_OPEN (not a readiness-hook verdict), and the readiness re-check (the
// open->start drop window) only runs once open() has already brought the clock source up.
bool dspic33ak_spi_i2s_tdm_inst_start( dspic33ak_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( ( s_config_mode != TDM_CONFIG_MODE_SINGLE ) || !tdm_inst_is_primary( inst ) )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( !s_stream.opened )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }
    if( !tdm_stream_ready_for_start() )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CLOCK_NOT_READY );
        return false;
    }
    if( !tdm_inst_arm( inst ) )
    {
        return false;
    }
    tdm_inst_go( inst );
    return true;
}


// Mode-agnostic teardown of every leg in one sync domain (idempotent; safe on stopped legs).
// PRIVATE: no config-mode gate, so the internal rollback in start_domain()/start_all_domains()
// and the public SYSTEM wrappers can both use it. Tears down every member via the per-leg impl.
static void tdm_stop_domain_impl( uint8_t domain )
{
    const uint8_t n = dspic33ak_spi_i2s_tdm_instance_count();
    for( uint8_t i = 0u; i < n; i++ )
    {
        dspic33ak_spi_i2s_tdm_inst_t* leg = dspic33ak_spi_i2s_tdm_inst( i );
        if( ( leg != NULL ) && ( leg->sync_domain == domain ) )
        {
            tdm_inst_stop_impl( leg );
        }
    }
}


// Public SYSTEM-mode stop of one sync domain. Rejects (false, HW unchanged) unless the stream was
// committed via configure_system() (mode==SYSTEM) -- a SINGLE-mode stream tears down through
// inst_stop(). Symmetric with start_domain(): an out-of-range (>=32) or MEMBER-LESS domain is
// ERR_BAD_INSTANCE (not a silent success); an existing-but-already-stopped domain is idempotent true.
bool dspic33ak_spi_i2s_tdm_stop_domain( uint8_t domain )
{
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    if( domain >= 32u )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    // Reject a domain with no member leg (an unknown id), mirroring start_domain()'s members==0 check.
    uint8_t       members = 0u;
    const uint8_t n       = dspic33ak_spi_i2s_tdm_instance_count();
    for( uint8_t i = 0u; i < n; i++ )
    {
        const tdm_spi_leg_t *leg = dspic33ak_spi_i2s_tdm_inst( i );
        if( ( leg != NULL ) && ( leg->sync_domain == domain ) )
        {
            members++;
        }
    }
    if( members == 0u )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    tdm_stop_domain_impl( domain );
    tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NONE );
    return true;
}


// Side-effect-free classification of one sync domain, shared by start_domain() (its preflight)
// and start_all_domains() (its whole-set preflight). A sync domain is a phase-locked UNIT whose
// INVARIANTS are re-checked at START -- not only in configure_system() -- because a member may
// have been (re)configured via the per-leg path afterwards. Sets *err ONLY for INVALID.
//   INVALID     : an unconfigured member (NOT_CONFIGURED), >1 clock MASTER (TOPOLOGY), a
//                 same-domain framing disagreement (TOPOLOGY), or no member at all (BAD_INSTANCE).
//   STOPPED     : every member configured + stopped -> startable.
//   ALL_RUNNING : every member already running -> a start is an idempotent no-op.
//   PARTIAL     : some-but-not-all members running -> reject WITHOUT teardown (a re-assert must
//                 not kill live audio; a half-running domain is a foreign/inconsistent state).
typedef enum {
    TDM_DOMAIN_INVALID = 0,
    TDM_DOMAIN_STOPPED,
    TDM_DOMAIN_ALL_RUNNING,
    TDM_DOMAIN_PARTIAL,
} tdm_domain_state_t;

static tdm_domain_state_t tdm_domain_classify( uint8_t domain, dspic33ak_spi_i2s_tdm_error_t *err )
{
    const uint8_t        n       = dspic33ak_spi_i2s_tdm_instance_count();
    const tdm_spi_leg_t *ref     = NULL;
    uint8_t              members = 0u;
    uint8_t              masters = 0u;
    uint8_t              running = 0u;

    for( uint8_t i = 0u; i < n; i++ )
    {
        const tdm_spi_leg_t *leg = dspic33ak_spi_i2s_tdm_inst( i );
        if( ( leg == NULL ) || ( leg->sync_domain != domain ) )
        {
            continue;
        }
        members++;
        if( !leg->config_valid )
        {
            *err = DSPIC33AK_SPI_I2S_TDM_ERR_NOT_CONFIGURED;
            return TDM_DOMAIN_INVALID;
        }
        if( leg->config.clock_role == DSPIC33AK_SPI_I2S_TDM_CLOCK_MASTER )
        {
            masters++;
        }
        if( leg->running )
        {
            running++;
        }
        if( ref == NULL )
        {
            ref = leg;
        }
        else if( !tdm_domain_framing_matches( &ref->config, &leg->config ) )
        {
            *err = DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY;
            return TDM_DOMAIN_INVALID;
        }
    }
    if( members == 0u )
    {
        *err = DSPIC33AK_SPI_I2S_TDM_ERR_BAD_INSTANCE;
        return TDM_DOMAIN_INVALID;
    }
    if( masters > 1u )
    {
        *err = DSPIC33AK_SPI_I2S_TDM_ERR_TOPOLOGY;
        return TDM_DOMAIN_INVALID;
    }
    if( running == 0u )
    {
        return TDM_DOMAIN_STOPPED;
    }
    return ( running == members ) ? TDM_DOMAIN_ALL_RUNNING : TDM_DOMAIN_PARTIAL;
}


// Start every config_valid leg of one sync domain PHASE-LOCKED: (1) ARM all members, then
// (2) release SPIEN back-to-back -- non-MASTER (slave/follower) legs first, the clock-MASTER
// leg (config.clock_role==MASTER) LAST. The adjacent go() calls make the members' ping-pong DMAs
// latch the same FS edge (external-FS domains have 0 masters -> all slaves go back-to-back;
// an internal-FS domain's master starts its BCLK/FS after the slaves are armed and listening).
// SYSTEM-mode API. Non-destructive: a fully-running domain is idempotent success; a partial/
// invalid domain is rejected WITHOUT teardown. Returns false (and rolls back only THIS call's
// arms) if a leg fails to arm. open() (shared clock/pins) must have run first; this does not.
bool dspic33ak_spi_i2s_tdm_start_domain( uint8_t domain )
{
    const uint8_t                 n = dspic33ak_spi_i2s_tdm_instance_count();
    dspic33ak_spi_i2s_tdm_error_t err;

    // SYSTEM-mode ownership: domain start is only for a configure_system()-committed stream.
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    // open() (shared clock/pins/CLC + readiness) MUST have run first.
    if( !s_stream.opened )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NOT_OPEN );
        return false;
    }

    // PREFLIGHT (zero side effects) via the shared classifier.
    const tdm_domain_state_t state = tdm_domain_classify( domain, &err );
    if( state == TDM_DOMAIN_INVALID )
    {
        tdm_set_error( err );
        return false;   // no side effects (do NOT stop_domain on a preflight reject)
    }
    if( state == TDM_DOMAIN_ALL_RUNNING )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_NONE );
        return true;    // already fully up -> idempotent no-op success
    }
    if( state == TDM_DOMAIN_PARTIAL )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;   // partial running -> reject, leave the domain as-is
    }

    // STOPPED and about to arm: re-check the clock-readiness gate (the open->start drop window).
    if( !tdm_stream_ready_for_start() )
    {
        tdm_set_error( DSPIC33AK_SPI_I2S_TDM_ERR_CLOCK_NOT_READY );
        return false;
    }

